import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import re
import torch
import torch.nn.backends
from torch.utils.data import DataLoader,TensorDataset
from torch.utils.tensorboard import SummaryWriter
from utils import *

#-------------------用户自定义参数-------------------------
data_source_path = r'C:\Users\zhaor\Desktop\Django\RouterSignalInference\media\uploads\training_data'  #.log源文件所在目录
#---------------------------------------------------------

#--------------------------训练参数设置------------------------------
data_save_path = os.path.join(os.path.dirname(data_source_path),'processed')
model_save_path = os.path.join(os.path.abspath(os.path.join(data_source_path,'../..')),'models')
config = {
    'random_seed':42,
    'layer':(128,256,128),
    'is_bsnorm':True,
    'n_epochs': 2000,                # 设置最大的训练批次
    'batch_size': 128,               # 设置数据加载器的batch_size，即每次迭代返回的数据数量
    'optimizer': 'Adam',              # 优化算法(optimizer in torch.optim)
    'optim_hparas': {                # 优化器的超参数设置 (具体取决于你所调用的优化器)
        'lr': 0.001,                
        # 'momentum': 0.9,
        # 'eps':1e-4             
    },
    'early_stop': 100,              # 提前结束批次(距离你模型性能上一次提升的批次数)
    'window_size':40,
    'fillvalue':-5,
    'colums':['servTa','servRssi','rsrp_59','rsrp_60','rsrp_61','rsrp_63','rsrp_187','rsrp_188',
          'rsrq_59','rsrq_60','rsrq_61','rsrq_63','rsrq_187','rsrq_188',
          'sinr_59','sinr_60','sinr_61','sinr_63','sinr_187','sinr_188'
        ],#排序后的列名
    'features_train':[
            # 'servTa',
            # 'servRssi',
            'rsrp_59','rsrp_60','rsrp_61','rsrp_63','rsrp_187','rsrp_188',
            # 'rsrq_59','rsrq_60','rsrq_61','rsrq_63','rsrq_187','rsrq_188',
            # 'sinr_59','sinr_60','sinr_61','sinr_63','sinr_187','sinr_188',
        ]#参与训练的特征
}

#-------------------------------------模型训练-----------------------------------------
# np.random.seed(config['random_seed'])

# model_loss, model_loss_record = Training(
#                                             data_source_path=data_source_path,
#                                             data_save_path=data_save_path,
#                                             model_save_path=model_save_path,
#                                             features_train=config['features_train'],
#                                             is_dropna=True,
#                                             is_smooth=True,
#                                             valid_ratio=0.2,
#                                             config=config
                                            
                                    
#                                             )

#--------------------------------------测试示例-----------------------------------------

'''
输入:tt_points                  测试样本，格式为二维array
输出：
curren selected model:xx.py     测试选取的model参数,为model_save_path路径下修改日期最新的那个
函数返回结果：
preds:[[x1,y1],[x2,y2],...]     测试样本的预测坐标[x,y]，是二维数组，长度为样本数/滑窗长度s
'''
#测试用例选取的第二轮补测数据中[4.0,10.8]位置的.log文件的前17行数据-->tt_points
tt_points = [[      4356, 3825238769, 1725184402,        188,         88,
                57,         45,         29,      -1040,        187,
                92,         58,         45,         59,         85,
                51,         36,         60,         42,         25,
                17,          0,          0,          0,          0,
                 0,          0,          0,          0],
       [      4357, 3825238769, 1725184403,        188,         88,
                57,         43,         29,      -1045,        187,
                91,         56,         42,         59,         87,
                52,         36,         60,         10,          6,
                 4,          0,          0,          0,          0,
                 0,          0,          0,          0],
       [      4358, 3825238769, 1725184403,        188,         89,
                53,         38,         29,      -1045,        187,
                92,         58,         46,         59,         87,
                53,         38,         63,         83,         45,
                27,         61,         82,         49,         32,
                60,         11,          6,          4],
       [      4359, 3825238769, 1725184404,        188,         86,
                52,         35,         29,      -1045,        187,
                91,         59,         45,         59,         88,
                55,         39,         60,         67,         41,
                27,         61,         60,         35,         22,
                63,         41,         24,         15],
       [      4360, 3825238769, 1725184404,        188,         90,
                55,         39,         29,      -1045,         59,
                91,         55,         40,        187,         90,
                56,         41,         60,         84,         52,
                36,         61,          7,          4,          3,
                63,          5,          3,          2],
       [      4361, 3825238769, 1725184405,        188,         89,
                59,         47,         29,      -1045,        187,
                90,         55,         39,         59,         89,
                54,         38,         60,         86,         56,
                42,         61,          2,          1,          0,
                63,          1,          0,          0],
       [      4362, 3825238769, 1725184405,        188,         89,
                60,         48,         29,      -1045,         59,
                89,         56,         41,        187,         88,
                53,         37,         60,         85,         56,
                41,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4363, 3825238769, 1725184406,        188,         96,
                63,         57,         29,      -1040,         59,
                90,         54,         38,         60,         86,
                52,         35,        187,         77,         47,
                33,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4364, 3825238769, 1725184406,        188,         95,
                62,         54,         29,      -1045,        187,
                88,         52,         36,         59,         45,
                27,         20,         60,         21,         13,
                 9,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4365, 3825238769, 1725184407,        188,         92,
                60,         50,         29,      -1045,        187,
                88,         57,         42,         59,          5,
                 3,          2,         60,          2,          1,
                 1,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4366, 3825238769, 1725184407,        188,         92,
                61,         52,         29,      -1045,        187,
                86,         58,         44,         59,          1,
                 1,          0,         60,          0,          0,
                 0,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4367, 3825238769, 1725184408,        188,         94,
                61,         51,         29,      -1045,        187,
                89,         60,         48,         59,         43,
                25,         17,         60,         41,         26,
                17,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4368, 3825238769, 1725184408,        188,         93,
                62,         53,         29,      -1045,        187,
                90,         55,         39,         60,         81,
                53,         40,         59,         80,         46,
                31,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4369, 3825238769, 1725184409,        188,         92,
                62,         54,         29,      -1045,        187,
                88,         51,         35,         60,         86,
                58,         46,         59,         83,         49,
                33,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4370, 3825238769, 1725184409,        188,         92,
                61,         53,         29,      -1045,         60,
                89,         60,         48,        187,         88,
                49,         33,         59,         85,         50,
                34,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4371, 3825238769, 1725184410,        188,         93,
                61,         53,         29,      -1040,         60,
                88,         60,         48,        187,         88,
                50,         34,         59,         86,         50,
                34,         61,          0,          0,          0,
                63,          0,          0,          0],
       [      4372, 3825238769, 1725184410,        188,         92,
                60,         50,         29,      -1040,         60,
                88,         59,         46,        187,         87,
                50,         33,         59,         87,         52,
                36,         61,          0,          0,          0,
                63,          0,          0,          0]]
preds = Infering(model_read_path=model_save_path,
                data_save_path=data_save_path,
                tt_list=tt_points,
                config=config,
                s=10,#滑窗长度
                is_smoothing=True
                ).numpy()
print(preds)